In [407]:
import numpy as np
import pandas as pd

#直接写入数据
df = pd.DataFrame({
    "id":[1001,1002,1003,1004,1005,1006],
    "date":pd.date_range('20130102', periods=6),
    "city":['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '],
    "age":[23,44,54,32,34,32],
    "category":['100-A','100-B','110-A','110-C','210-A','130-F'],
    "price":[1200,np.nan,2133,5433,np.nan,4432]},
    columns =['id','date','city','category','age','price'])

df

# 一、数据表检查
'''
数据表检查的目的是了解数据表的整体情况，获得数据表的关键信息、
数据的概况，例如整个数据表的大小、所占空间、数据格式、是否有
空值和重复项和具体的数据内容，为后面的清洗和预处理做好准备。
'''

'\n数据表检查的目的是了解数据表的整体情况，获得数据表的关键信息、\n数据的概况，例如整个数据表的大小、所占空间、数据格式、是否有\n空值和重复项和具体的数据内容，为后面的清洗和预处理做好准备。\n'

In [408]:
#1.数据维度(行列)
df.shape

(6, 6)

In [409]:
#2.数据表信
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        6 non-null      int64
 1   date      6 non-null      datetime64[ns]
 2   city      6 non-null      object
 3   category  6 non-null      object
 4   age       6 non-null      int64
 5   price     4 non-null      float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 416.0+ bytes

In [410]:
#3.检验空值
df.isnull()

      id   date   city  category    age  price
0  False  False  False     False  False  False
1  False  False  False     False  False   True
2  False  False  False     False  False  False
3  False  False  False     False  False  False
4  False  False  False     False  False   True
5  False  False  False     False  False  False

In [411]:
#检验特定列是否为空
df['price'].isnull()

0    False
1     True
2    False
3    False
4     True
5    False
Name: price, dtype: bool

In [412]:
# 4.查看是否唯一值
df['city'].unique()

array(['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai',
       'BEIJING '], dtype=object)

In [413]:
#查看数据表数值
df.values

array([[1001, Timestamp('2013-01-02 00:00:00'), 'Beijing ', '100-A', 23,
        1200.0],
       [1002, Timestamp('2013-01-03 00:00:00'), 'SH', '100-B', 44, nan],
       [1003, Timestamp('2013-01-04 00:00:00'), ' guangzhou ', '110-A',
        54, 2133.0],
       [1004, Timestamp('2013-01-05 00:00:00'), 'Shenzhen', '110-C', 32,
        5433.0],
       [1005, Timestamp('2013-01-06 00:00:00'), 'shanghai', '210-A', 34,
        nan],
       [1006, Timestamp('2013-01-07 00:00:00'), 'BEIJING ', '130-F', 32,
        4432.0]], dtype=object)

In [414]:
#查看列名称
df.columns

Index(['id', 'date', 'city', 'category', 'age', 'price'], dtype='object')

In [415]:
#查看前N行数据
df.head()

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     NaN

In [416]:
#数据描述
df.describe()

                id       age        price
count     6.000000   6.00000     4.000000
mean   1003.500000  36.50000  3299.500000
std       1.870829  10.87658  1966.638503
min    1001.000000  23.00000  1200.000000
25%    1002.250000  32.00000  1899.750000
50%    1003.500000  33.00000  3282.500000
75%    1004.750000  41.50000  4682.250000
max    1006.000000  54.00000  5433.000000

In [417]:
df.head(10)

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     NaN
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [418]:
#查看后3行数据
df.tail()

     id       date         city category  age   price
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     NaN
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [419]:
df.tail(3)

     id       date      city category  age   price
3  1004 2013-01-05  Shenzhen    110-C   32  5433.0
4  1005 2013-01-06  shanghai    210-A   34     NaN
5  1006 2013-01-07  BEIJING     130-F   32  4432.0

In [420]:
# 二、数据表清洗
# 本章介绍对数据表中的问题进行清洗，包括对空值、大小写问题、数据格式和重复值的处理。

In [421]:
#1.处理空值（删除或者填充）
#删除数据表中含有空值的行
data =  df.dropna(how ='any')
data.head(10)

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [422]:
#使用数字0填充数据表中空值
df.fillna(value=0)
df.head(10)

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     NaN
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [423]:
'''
使用price列的均值来填充NA字段，同样使用fillna函数，
在要填充的数值中使用mean函数先计算price列当前的均值，
然后使用这个均值对NA进行填充。
'''
#使用price均值对NA进行填充
df['price'] = df['price'].fillna(df['price'].mean())
print(df)
#调sklearn的插补库
from sklearn.impute import SimpleImputer
imr = SimpleImputer(strategy='mean')
column = ['price']
df[column]  = imr.fit_transform(df[column])
df.head(10)

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44  3299.5
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34  3299.5
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44  3299.5
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34  3299.5
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [424]:
#清理空格
#清理city中的空格字符
df['city'] = df['city'].map(str.strip)
df

     id       date       city category  age   price
0  1001 2013-01-02    Beijing    100-A   23  1200.0
1  1002 2013-01-03         SH    100-B   44  3299.5
2  1003 2013-01-04  guangzhou    110-A   54  2133.0
3  1004 2013-01-05   Shenzhen    110-C   32  5433.0
4  1005 2013-01-06   shanghai    210-A   34  3299.5
5  1006 2013-01-07    BEIJING    130-F   32  4432.0

In [425]:
#大小写转换
df['city'].str.lower()

0      beijing
1           sh
2    guangzhou
3     shenzhen
4     shanghai
5      beijing
Name: city, dtype: object

In [426]:
#更该数据格式
df['price'].astype('int')

0    1200
1    3299
2    2133
3    5433
4    3299
5    4432
Name: price, dtype: int32

In [427]:
#更改列的名称
df.rename(columns={'category': 'category-size'})

     id       date       city category-size  age   price
0  1001 2013-01-02    Beijing         100-A   23  1200.0
1  1002 2013-01-03         SH         100-B   44  3299.5
2  1003 2013-01-04  guangzhou         110-A   54  2133.0
3  1004 2013-01-05   Shenzhen         110-C   32  5433.0
4  1005 2013-01-06   shanghai         210-A   34  3299.5
5  1006 2013-01-07    BEIJING         130-F   32  4432.0

In [428]:
#删除重复值
df['city'].drop_duplicates()

0      Beijing
1           SH
2    guangzhou
3     Shenzhen
4     shanghai
5      BEIJING
Name: city, dtype: object

In [429]:
# 设置keep='last‘’参数后，与之前删除重复值的结果相反，第一位 出现的beijing被删除
df['city'].drop_duplicates(keep='last')

0      Beijing
1           SH
2    guangzhou
3     Shenzhen
4     shanghai
5      BEIJING
Name: city, dtype: object

In [430]:
#数值修改和替换
# df['city'].replace('SH','shanghai')

In [431]:
#三、数据预处理
# 本章主要讲的是数据的预处理，对清洗完的数据进行整理以便后期的统计和分析工作。主要包括数据表的合并，排序，数值分列，数据分组及标记等工作。
#建立df1数据表
df1=pd.DataFrame({
    "id":[1001,1002,1003,1004,1005,1006,1007,1008],
    "gender":['male','female','male','female','male','female','male','female'],
    "pay":['Y','N','Y','Y','N','Y','N','Y',],
    "m-point":[10,12,20,40,40,40,30,20]})
df1

     id  gender pay  m-point
0  1001    male   Y       10
1  1002  female   N       12
2  1003    male   Y       20
3  1004  female   Y       40
4  1005    male   N       40
5  1006  female   Y       40
6  1007    male   N       30
7  1008  female   Y       20

In [432]:
#数据表匹配合并
df_inner = pd.merge(df,df1,how='inner')
df_inner

     id       date       city category  age   price  gender pay  m-point
0  1001 2013-01-02    Beijing    100-A   23  1200.0    male   Y       10
1  1002 2013-01-03         SH    100-B   44  3299.5  female   N       12
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male   Y       20
3  1004 2013-01-05   Shenzhen    110-C   32  5433.0  female   Y       40
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male   N       40
5  1006 2013-01-07    BEIJING    130-F   32  4432.0  female   Y       40

In [433]:
#合并方式还有left,right,outer 类似mysql的联合查询
df_left=pd.merge(df,df1,how='left')
df_right=pd.merge(df,df1,how='right')
df_outer=pd.merge(df,df1,how='outer')

In [434]:
#设置索引列
#索引列可以进行数据 提取，汇总，数据筛选
df_inner.set_index('id')
df_inner

     id       date       city category  age   price  gender pay  m-point
0  1001 2013-01-02    Beijing    100-A   23  1200.0    male   Y       10
1  1002 2013-01-03         SH    100-B   44  3299.5  female   N       12
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male   Y       20
3  1004 2013-01-05   Shenzhen    110-C   32  5433.0  female   Y       40
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male   N       40
5  1006 2013-01-07    BEIJING    130-F   32  4432.0  female   Y       40

In [435]:
#排序 sort_values函数和sort_index函数完成排序
df_inner.sort_values(by=['age'])

     id       date       city category  age   price  gender pay  m-point
0  1001 2013-01-02    Beijing    100-A   23  1200.0    male   Y       10
3  1004 2013-01-05   Shenzhen    110-C   32  5433.0  female   Y       40
5  1006 2013-01-07    BEIJING    130-F   32  4432.0  female   Y       40
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male   N       40
1  1002 2013-01-03         SH    100-B   44  3299.5  female   N       12
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male   Y       20

In [436]:
#按索引列排列
df_inner.sort_index()

     id       date       city category  age   price  gender pay  m-point
0  1001 2013-01-02    Beijing    100-A   23  1200.0    male   Y       10
1  1002 2013-01-03         SH    100-B   44  3299.5  female   N       12
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male   Y       20
3  1004 2013-01-05   Shenzhen    110-C   32  5433.0  female   Y       40
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male   N       40
5  1006 2013-01-07    BEIJING    130-F   32  4432.0  female   Y       40

In [437]:
#数据分组
'''
Excel中可以通过VLOOKUP函数进行近似匹配来完成对数值的分组，或者使用“数据透视表”来完成分组

Python中使用Where函数用来对数据进行判断和分组
'''
#如果price列的值>3000，group列显示high，否则显示low
df_inner['price_group'] = np.where(df_inner['price'] > 3000,'high','low')
df_inner

,id,date,city,category,age,price,gender,pay,m-point,price_group
0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,Y,10,low
1,1002,2013-01-03,SH,100-B,44,3299.5,female,N,12,high
2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,Y,20,low
3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,Y,40,high
4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,N,40,high
5,1006,2013-01-07,BEIJING,130-F,32,4432.0,female,Y,40,high

In [438]:
#对复合多个条件的数据进行分组标记 多个条件用括号包着  用| &连接
df_inner.loc[(df_inner['city'] == 'Shenzhen') & (df_inner['price']
>= 4000), 'sign']=1
df_inner

,id,date,city,category,age,price,gender,pay,m-point,price_group,sign
0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,Y,10,low,NaN
1,1002,2013-01-03,SH,100-B,44,3299.5,female,N,12,high,NaN
2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,Y,20,low,NaN
3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,Y,40,high,1.0
4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,N,40,high,NaN
5,1006,2013-01-07,BEIJING,130-F,32,4432.0,female,Y,40,high,NaN

In [439]:
#数据分列
'''
在Python中使用split函数实现分列在数据表中category列中的数据包含有两个信息，前面的数字为
类别id，后面的字母为size值。中间以连字符进行连接。我们使用split函数对这个字段进行拆分，
并将拆分后的数据表匹配回原数据表中。
'''
split = pd.DataFrame((x.split('-') for x in df_inner['category']),index = df_inner.index,columns=['category','size'])

In [440]:
#将完成分列后的数据表与原df_inner数据表进行匹配
df_inner=pd.merge(df_inner,split,right_index=True, left_index=True)
df_inner

,id,date,city,category_x,age,price,gender,pay,m-point,price_group,sign,category_y,size
0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,Y,10,low,NaN,100,A
1,1002,2013-01-03,SH,100-B,44,3299.5,female,N,12,high,NaN,100,B
2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,Y,20,low,NaN,110,A
3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,Y,40,high,1.0,110,C
4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,N,40,high,NaN,210,A
5,1006,2013-01-07,BEIJING,130-F,32,4432.0,female,Y,40,high,NaN,130,F

In [441]:
#五、数据提取
#按索引提取单行的数值
df_inner.loc[3]

id                            1004
date           2013-01-05 00:00:00
city                      Shenzhen
category_x                   110-C
age                             32
price                       5433.0
gender                      female
pay                              Y
m-point                         40
price_group                   high
sign                           1.0
category_y                     110
size                             C
Name: 3, dtype: object

In [442]:
#按索引提取区域行数值
df_inner.loc[0:5]

,id,date,city,category_x,age,price,gender,pay,m-point,price_group,sign,category_y,size
0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,Y,10,low,NaN,100,A
1,1002,2013-01-03,SH,100-B,44,3299.5,female,N,12,high,NaN,100,B
2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,Y,20,low,NaN,110,A
3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,Y,40,high,1.0,110,C
4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,N,40,high,NaN,210,A
5,1006,2013-01-07,BEIJING,130-F,32,4432.0,female,Y,40,high,NaN,130,F

In [443]:
# Reset_index函数用于恢复索引，这里我们重新将date字段的日期 设置为数据表的索引，并按日期进行数据提取。
#重设索引
df_inner.reset_index()

,index,id,date,city,category_x,age,price,gender,pay,m-point,price_group,sign,category_y,size
0,0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,Y,10,low,NaN,100,A
1,1,1002,2013-01-03,SH,100-B,44,3299.5,female,N,12,high,NaN,100,B
2,2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,Y,20,low,NaN,110,A
3,3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,Y,40,high,1.0,110,C
4,4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,N,40,high,NaN,210,A
5,5,1006,2013-01-07,BEIJING,130-F,32,4432.0,female,Y,40,high,NaN,130,F

In [444]:
#设置日期为索引
df_inner = df_inner.set_index('date')

In [445]:
#按位置提取 iloc
# 使用iloc函数按位置对数据表中的数据进行提取，这里冒号前后 的数字不再是索引的标签名称，而是数据所在的位置，从0开始。
#使用iloc按位置区域提取数据
df_inner.iloc[:3,:2]

              id       city
date
2013-01-02  1001    Beijing
2013-01-03  1002         SH
2013-01-04  1003  guangzhou

In [446]:
# 3.按标签和位置提取（ix）
# df_inner.ix[:'2013-01-03',:4]

In [447]:
# 4.按条件提取（区域和条件值）
# 使用loc和isin两个函数配合使用，按指定条件对数据进行提取
#判断city列的值是否为beijing
df_inner['city'].isin(['Beijing'])

date
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
2013-01-07    False
Name: city, dtype: bool

In [448]:
# 将isin函数嵌套到loc的数据提取函数中，将判断结果为Ture数据 提取出来。这里我们把判断条件改为city值是否为beijing和shanghai。如果是就把这条数据提取出来。
#先判断city列里是否包含beijing和shanghai，然后将复合条件的数据提取出来。
df_inner.loc[df_inner['city'].isin(['beijing','shanghai'])]

,id,city,category_x,age,price,gender,pay,m-point,price_group,sign,category_y,size
date,,,,,,,,,,,,
2013-01-06,1005,shanghai,210-A,34,3299.5,male,N,40,high,NaN,210,A

In [449]:
#六、数据筛选
# Python中使用loc函数配合筛选条件来完成筛选功能。配合sum和count函数还能实现Excel中sumif和countif函数的功能。使用“与”条件进行筛选，条件是年龄大于25岁，并且城市为 beijing。
#使用与 条件进行筛选
df_inner.loc[(df_inner['age'] > 25) & (df_inner['city'] == 'Beijing'), ['id','city','age','category_x','gender']]

Empty DataFrame
Columns: [id, city, age, category_x, gender]
Index: []

In [450]:
#使用或 条件进行筛选
df_inner.loc[(df_inner['age'] > 25) | (df_inner['city'] == 'Beijing'), ['id','city','age','category_x','gender']]

              id       city  age category_x  gender
date
2013-01-02  1001    Beijing   23      100-A    male
2013-01-03  1002         SH   44      100-B  female
2013-01-04  1003  guangzhou   54      110-A    male
2013-01-05  1004   Shenzhen   32      110-C  female
2013-01-06  1005   shanghai   34      210-A    male
2013-01-07  1006    BEIJING   32      130-F  female

In [451]:
#使用“非”条件进行筛选
df_inner.loc[(df_inner['city'] != 'beijing'), ['id','city','age','category_x','gender']]

              id       city  age category_x  gender
date
2013-01-02  1001    Beijing   23      100-A    male
2013-01-03  1002         SH   44      100-B  female
2013-01-04  1003  guangzhou   54      110-A    male
2013-01-05  1004   Shenzhen   32      110-C  female
2013-01-06  1005   shanghai   34      210-A    male
2013-01-07  1006    BEIJING   32      130-F  female

In [452]:
#对筛选后的数据按city列进行计数
df_inner.loc[(df_inner['city'] != 'beijing'), ['id','city','age','category_x','gender']].sort(['id']).city.count()

AttributeError: 'DataFrame' object has no attribute 'sort'

In [ ]:
# 还有一种筛选的方式是用query函数
df_inner.query('city == ["beijing", "shanghai"]')

In [ ]:
# 在前面的代码后增加price字段和sum函数。对筛选后的price字段 进行求和，相当于Excel中的sumifs函数的功能。
#对筛选后的结果按price进行求和
df_inner.query('city == ["Beijing", "shanghai"]').price.sum()

In [ ]:
# Excel中使用分类汇总和数据透视可以按特定维度对数据进行汇总，Python中使用的主要函数是groupby和pivot_table。
#分类汇总
#对所有列进行计数汇总
#对所有列进行计数汇总
df_inner.groupby('city').count()

In [ ]:
#对特定的ID列进行计数汇总
df_inner.groupby('city')['id'].count()

In [ ]:
#对两个字段进行汇总计数
df_inner.groupby(['city','size'])['id'].count()

In [ ]:
#对city字段进行汇总并计算price的合计和均值。
df_inner.groupby('city')['price'].agg([len,np.sum, np.mean])

In [ ]:
#设定city为行字段，size为列字段，price为值字段。
# 分别计算price的数量和金额并且按行与列进行汇总。
pd.pivot_table(df_inner,index=["city"],values=["price"],columns=["size"],aggfunc=[len,np.sum],fill_value=0,margins=True)

In [ ]:
# 七、数据统计
# Python通过sample函数完成数据采样

#简单的数据采样
df_inner.sample(n=3)

In [ ]:
# Weights参数是采样的权重，通过设置不同的权重可以更改采样的结果
#手动设置采样权重
weights = [0, 0, 0, 0, 0.5, 0.5]
df_inner.sample(n=2, weights=weights)

In [ ]:
# Sample函数中参数replace，用来设置采样后是否放回
#采样后不放回
df_inner.sample(n=6, replace=False)
#采样后放回
df_inner.sample(n=6, replace=True)

In [ ]:
#描述统计
# Python中可以通过Describe对数据进行描述统计
#数据表描述性统计
df_inner.describe().round(2)

In [ ]:
# Python中则通过corr函数完成相关分析的操作，并返回相关系数。
#相关性分析
df_inner['price'].corr(df_inner['m-point'])

#数据表相关性分析
df_inner.corr()

In [ ]:
#数据输出
#写入Excel
df_inner.to_excel('Excel_to_Python.xlsx', sheet_name='bluewhale_cc')
df_inner

In [ ]:
#输出到CSV格式
df_inner.to_csv('Excel_to_Python.csv')